{
    "name": "Integrated Dynamics Storage",
    "icon": "integratedterminals:part_terminal_storage",
    "category": "patchouli:storage",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "Integrated Dynamics allows you to create efficient storage networks. Follow this guide to set up a basic storage network with chests and access it through a Storage Terminal."
        },
        {
            "type": "patchouli:crafting",
            "recipe": "integrateddynamics:crafting/cable",
            "text": "Craft Cables to connect all components in the network."
        },
        {
            "type": "patchouli:crafting",
            "recipe": "integratedtunnels:crafting/part_interface_item",
            "text": "Craft Item Interfaces to connect storage containers like chests to the network."
        },
        {
            "type": "patchouli:crafting",
            "recipe": "integratedterminals:crafting/part_terminal_storage",
            "text": "Craft a Storage Terminal to access the network and manage your items."
        },
        {
            "type": "patchouli:text",
            "text": "Setting Up the Network$(br2)1. Place the Chests: Arrange the chests where you want to store your items.$(br2)2. Connect Cables: Run cables from one chest to another, forming a network. Ensure all chests are connected through the cables."
        },
        {
            "type": "patchouli:text",
            "text": "Attaching Item Interfaces$(br2)1. Attach Item Interfaces: Place an Item Interface on each chest you want to connect to the network.$(br2)2. Connect Item Interfaces to Cables: Ensure the Item Interfaces are connected to the network cables, forming a complete network."
        },
        {
            "type": "patchouli:text",
            "text": "Using the Storage Terminal$(br2)1. Place a Storage Terminal: Attach a Storage Terminal to your network cables.$(br2)2. Access the Network: Right-click on the Storage Terminal to open the interface. You can view, insert, and extract items from any connected chest within the network."
        }
    ]
}
