{
    "name": "Applied Energistics 2",
    "icon": "ae2:fluix_crystal",
    "category": "patchouli:mod_info",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "Applied Energistics 2 (AE2) is a comprehensive storage and automation mod. $(br2)With a focus on digital storage, AE2 lets you organize, search, and manage all your items effortlessly. $(br2)Build intricate networks to process materials, automate crafting, and keep everything neat and accessible."
        },
        {
            "type": "patchouli:image",
            "images": ["bth:images/guide/meteorite.png"],
            "title": "Finding a Meteorite",
            "text": "Meteorites are key to starting AE2! Search for these sites to find Skystone and Inscriber Presses."
        },
        {
            "type": "patchouli:text",
            "text": "Inside the meteorite, you'll also find Certus Quartz, a key material for AE2. You cannot move Flawless Certus Quartz blocks with packing tape; you'll need to progress to spatial storage to do so. $(br2)Until then, you can break the other blocks with Silk Touch to move them and repair them as they degrade. Note that Flawless Certus Quartz blocks never get damaged."
        },
        {
            "type": "patchouli:crafting",
            "recipe": "ae2:network/blocks/crystal_processing_charger",
            "title": "Crafting a Charger",
            "text": "$(br2)Craft a Charger to create Charged Certus Quartz, then combine it with Redstone and Nether Quartz to form Fluix Crystals."
        },
        {
            "type": "patchouli:text",
            "text": "From here, you'll build a game-changing basic ME Storage network. As you expand your AE2 network, build ME Controllers to increase its capacity. $(br2)Automate crafting with Molecular Assemblers and Crafting Co-Processors, and manage your items with ME Storage Cells. $(br2)With P2P tunnels, you can even transfer signals, fluids, and more between distant networks!"
        },
        {
            "type": "patchouli:text",
            "text": "For more detailed information, AE2 offers an in-game guide. $(br2)You can hover over AE2 items in JEI and hold the 'G' key for quick access to the guide."
        }
    ]
}
