{
    "name": "Forbidden & Arcanus",
    "icon": "forbidden_arcanus:deorum_ingot",
    "category": "patchouli:mod_info",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "Forbidden & Arcanus brings magic, mystery, and powerful artifacts to Minecraft. Explore the mystical Deorum metal, harness the power of Dark Matter, and wield magic items worthy of legend."
        },
        {
            "type": "patchouli:text",
            "text": "$(l)Key Features$() $(br2)- $(l)Deorum$(): A new magical metal. $(br2)- $(l)Dark Matter$(): Harness dark energy for powerful artifacts. $(br2)- $(l)Arcane Crystal$(): Craft potent tools and gear."
        },
        {
            "type": "patchouli:text",
            "title": "Magical Artifacts",
            "text": "- $(l)Magical Ring$(): Equip rings with powerful effects. $(br2)- $(l)Mystical Essences$(): Combine essences to create new magical items."
        },
        {
            "type": "patchouli:text",
            "title": "Rituals and Exploration",
            "text": "- $(l)Rituals$(): Perform rituals to gain special powers. $(br2)- $(l)Exploration$(): Discover hidden structures and dungeons filled with treasure."
        },
        {
            "type": "patchouli:text",
            "title": "Deorum",
            "text": "Deorum is a mystical metal found in the depths of the earth. It is used to craft powerful tools and armor with magical properties. Seek out Deorum ore to unlock its full potential."
        },
        {
            "type": "patchouli:text",
            "title": "Dark Matter",
            "text": "Dark Matter is a substance of immense power. Harnessing it allows the creation of some of the most potent artifacts in Forbidden & Arcanus. Use it wisely, as its energy is both a gift and a curse."
        },
        {
            "type": "patchouli:text",
            "title": "Arcane Crystal",
            "text": "Arcane Crystals are rare and hold great power. These crystals are essential in crafting tools and gear that are unmatched in their magical capabilities. Collect them to enhance your magical prowess."
        },
        {
            "type": "patchouli:text",
            "title": "Magical Ring",
            "text": "Magical Rings come with a variety of powerful effects. These rings can be equipped to grant the wearer special abilities, enhancing their magical capabilities."
        },
        {
            "type": "patchouli:text",
            "title": "Mystical Essences",
            "text": "Mystical Essences are the core components used to create new magical items. By combining different essences, you can unlock new powers and craft unique artifacts."
        },
        {
            "type": "patchouli:text",
            "title": "Rituals",
            "text": "Rituals are an essential part of Forbidden & Arcanus. Perform these mystical ceremonies to gain special powers, summon entities, or unlock hidden secrets within the mod."
        },
        {
            "type": "patchouli:text",
            "title": "Exploration",
            "text": "The world of Forbidden & Arcanus is filled with hidden structures and dungeons. Explore these areas to find treasure, rare materials, and ancient artifacts that will aid in your magical journey."
        },
        {
            "type": "patchouli:text",
            "title": "Hephaestus Forge",
            "text": "The Hephaestus Forge is a powerful crafting device used to create unique and powerful items. To construct the forge, follow the specific multiblock pattern. Once built, place the required ingredients in the center and activate the forge to begin the crafting process. The forge allows you to unlock several unique recipes by experimenting with different materials."
        },
        {
            "type": "patchouli:multiblock",
            "name": "Hephaestus Forge",
            "multiblock": {
                "pattern": [
                    ["         ", "         ", "         ", "         ", "    0    ", "         ", "         ", "         ", "         "],
                    ["   PPP   ", " PPPAPPP ", " PAPPPAP ", "PPPPCPPPP", "PAPCACPAP", "PPPPCPPPP", " PAPPPAP ", " PPPAPPP ", "   PPP   "]
                ],
                "mapping": {
                    "P": "forbidden_arcanus:polished_darkstone",
                    "A": "forbidden_arcanus:arcane_chiseled_polished_darkstone",
                    "C": "forbidden_arcanus:chiseled_arcane_polished_darkstone"
                },
                "symmetrical": true
            }
        },
        {
            "type": "patchouli:text",
            "title": "Activating the Forge",
            "text": "To activate the Hephaestus Forge, you will need the following items: 48 Polished Darkstone, 9 Arcane Chiseled Polished Darkstone, 4 Chiseled Arcane Polished Darkstone, 1 Smithing Table, and 1 Mundabitur Dust. Place the Smithing Table on the center block and shift-right click on it with Mundabitur Dust. Lightning will strike, and the forge will be ready to use."
        }
    ]
}
