{
    "name": "Aetherian Ancestry",
    "icon": "aether:aether_portal_frame",
    "category": "patchouli:the_beginning",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "$(l)Listen closely, adventurer$(). You are a descendant of an ancient civilization renowned for its ingenuity and love of exploration -- The Aetherians -- Those who spent their time in the skies developed enhanced vision and could see 'Beyond the Horizon.' You've inherited this trait and a hunger for exploration."
        },
        {
            "type": "patchouli:text",
            "text": "$(l)A Legacy Reclaimed$() $(br2)Your journey begins amongst towering mountains, vast plains, and lush forests. You find refuge in an abandoned structure and set your sights on establishing your presence in the world with the aid of technology and magic.$(br2)Your first goal: Tame a fast horse to take you on your adventures."
        },
        {
            "type": "patchouli:text",
            "text": "$(l)This Journal Is The Key$()$(br2)Long ago, in a dusty attic, you found this journal left by one of your ancestors, revealing your story and how to create a portal to The Aether, and the lost knowledge of how to enter The End."
        },
        {
            "type": "patchouli:text",
            "text": "$(l)The End: Remastered$()$(br2)Centuries ago, the Aether's elders locked The End behind a portal in a Lost Castle to protect all realms from the Dragon. They crafted 16 unique Eyes $(l:the_beginning/the_end)and scattered them across dimensions$(), within structures guarded by dangerous creatures. Only the worthy, through courage, wisdom, and strength, could gather these Eyes, retrieve a map from a cartographer and unlock the gateway to the End. Is this you?"
        },
        {
            "type": "patchouli:text",
            "text": "$(l)Into the Nether and Skyward Pilgrimage$() $(br2)You must mine obsidian to construct the Nether portal and then step into the fiery depths of the Nether. There, you seek out glowstone, nether quartz, and ancient debris - the essential components for your technological progression and eventual entry into The Aether."
        },
        {
            "type": "patchouli:text",
            "text": "With these resources secured, you journey back to the Overworld, inspired by ancient knowledge gained through exploration and experimentation. You construct motor vehicles and build ocean-worthy ships as you ready yourself for the voyage to The Aether."
        },
        {
            "type": "patchouli:text",
            "text": "Crossing through the Aether portal, you uncover the remnants of your ancestors' civilization - Gravitite-powered aircraft, Moas bred for riding, and floating islands rich with ores and ruins. You mine Gravitite ore, crucial for crafting airship hulls."
        },
        {
            "type": "patchouli:text",
            "text": "$(l)The World Reborn$() $(br2)Returning from The Aether, you integrate the relics of the past with modern technology. You establish a base to create a foundation of your technological and magical mastery, while never losing that taste for adventure. That's good because you must defeat the Dragon to fulfill your legacy."
        },
        {
            "type": "patchouli:text",
            "text": "Your transportation network expands with motor vehicles and airships. You utilize Technology from PneumaticCraft, Create, and Immersive Engineering and magic from Botania and Ars Nouveau. You leverage various mounts to aid your mobility across vast landscapes, taming Horses, Elephants, Moas, and Grizzly Bears along the way."
        },
        {
            "type": "patchouli:text",
            "text": "As your network of airships, cars, and railways expands, you discover old enemies lurking beneath the surface. The once-banished Mutant Monsters have returned, threatening villages."
        },
        {
            "type": "patchouli:text",
            "text": "Armed with tools of technology and magic, you take the fight underground, battling mutants and exploring new dimensions. But danger isn't the only thing you find -- you learn of another civilization that thrived alongside your ancestors, the $(l:the_beginning/rats)Ratlantians$()."
        },
        {
            "type": "patchouli:text",
            "text": "To gain access to their lost world, and their treasures, you must seek out their ancient currency to craft a relic that will take you there. If you dare..."
        },
        {
            "type": "patchouli:text",
            "text": "$(l)Epilogue: Beyond the Horizon$() $(br2)With each biome explored, each relic uncovered, and each enemy vanquished, your legacy is secure. You build cozy homes using Hearth & Home, harness magic from Botania and spellbooks, and master the arts with Joy of Painting and Music Maker."
        },
        {
            "type": "patchouli:text",
            "text": "$(l)Conclusion$() $(br2)This journey is yours, adventurer. From reclaiming the skies to taming beasts and mastering machinery, your story is what you make of it. So grab your compass, pack your bags, and write your own legend Beyond the Horizon."
        }
    ]
}
