{
  "name": "Ratlantis",
  "category": "patchouli:intro",
  "icon": "rats:cheese",
  "pages": [
    {
      "type": "text",
      "text": "In a hidden corner of the world lies Ratlantis, a once-thriving dimension ruled by the advanced civilization of the Ratlanteans. These intelligent rats were renowned for their technological prowess, with their most remarkable invention being the Dimensional Skiffs—vessels capable of traversing the boundaries between dimensions."
    },
    {
      "type": "text",
      "text": "Among the Ratlanteans were the Pirats, seafaring rat traders who piloted these skiffs through dimensional rifts to trade with the inhabitants of the Overworld, Nether, and Aether. They crafted tiny coins from a material resembling hardened cheese, hoping to use them for trade."
    },
    {
      "type": "text",
      "text": "To their delight, these inhabitants eagerly accepted the unique currency, and trade flourished. The rats exchanged their coins for trinkets and artifacts from all dimensions, spreading the coins far and wide. The coins held a fragment of Ratlantis's power, adding to their allure."
    },
    {
      "type": "text",
      "text": "However, trade eventually subsided due to frequent shipwrecks and technological problems with the Dimensional Skiffs. Today, remnants of these advanced vessels can be found within Ratlantis, accessible to those who discover the elusive gateway to this enigmatic dimension."
    },
    {
      "type": "text",
      "text": "Occasionally, explorers may stumble upon shipwrecks in the Overworld that once belonged to the Pirats. Most of these ships have been thoroughly looted over time, leaving behind only fragments of their original treasures. The real wealth lies hidden within Ratlantis."
    },
    {
      "type": "text",
      "text": "In Ratlantis, unlooted shipwrecks, sunken chests, and buried treasure hold the true treasures traded and taken there by the Pirats across all dimensions. The rats who remained stranded outside of Ratlantis, descendants of the original Pirats, have become incredibly resourceful."
    },
    {
      "type": "text",
      "text": "These intelligent creatures can be trained to perform a variety of tasks, making them valuable allies. They offer their services in exchange for food and protection, assisting with everything from gathering resources to defending against threats."
    },
    {
      "type": "text",
      "text": "Their adaptability and cleverness have allowed them to thrive in their new environment, continuing the legacy of their Ratlantean ancestors. The secrets of Ratlantis and its Dimensional Skiffs have been lost to time, but clues remain for those who befriend the stranded rats."
    },
    {
      "type": "text",
      "text": "The gateway to Ratlantis is hidden, waiting to be rediscovered by adventurous souls eager to uncover the lost loot taken there by the Pirats. Adventurers seeking to unlock the secrets of Ratlantis must gather these coins, scattered across dimensions in various forms of loot."
    },
    {
      "type": "text",
      "text": "The quest to collect 729 tiny coins to craft a Chunky Cheese Token is a daunting challenge but offers the promise of untold riches and advanced technology hidden within Ratlantis. The Ratlanteans, despite their tumultuous history, are depicted as intelligent and innovative beings."
    },
    {
      "type": "text",
      "text": "Their legacy of exploration and trade continues to inspire those who seek to uncover the mysteries of their lost world."
    }
  ]
}
